'use strict';

module.exports = [
  {
    "user": `ivanov@example.com`,
    "title": `Как собрать камни бесконечности`,
    "announce": `Из под его пера вышло 8 платиновых альбомов.`,
    "articleText": `Он написал больше 30 хитов. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Достичь успеха помогут ежедневные повторения.`,
    "categories": [`Кино`, `Разное`],
    "comments": [
      {
        "user": `ivanov@example.com`,
        "text": `Хочу такую же футболку :-)\r Мне кажется или я уже читал это где-то?\r Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.\r`
      },
      {
        "user": `petrov@example.com`,
        "text": `Плюсую, но слишком много буквы!\r`
      },
      {
        "user": `sidorov@example.com`,
        "text": `Хочу такую же футболку :-)\r Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.\r Мне кажется или я уже читал это где-то?\r`}
    ]
  },
  {
    "user": `petrov@example.com`,
    "title": `Лучшие рок-музыканты 20-века`,
    "announce": `Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.`,
    "articleText": `Ёлки — это не просто красивое дерево. Это прочная древесина. Собрать камни бесконечности легко, если вы прирожденный герой. Как начать действовать? Для начала просто соберитесь. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.`,
    "categories": [`Программирование`, `Без рамки`, `Кино`, `IT`, `Деревья`, `Разное`],
    "comments": [
      {
        "user": `ivanov@example.com`,
        "text": `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.\r`
      },
      {
        "user": `sidorov@example.com`,
        "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.\r`
      }
    ]
  },
  {
    "user": `petrov@example.com`,
    "title": `Как начать программировать`,
    "announce": `Золотое сечение — соотношение двух величин, гармоническая пропорция.`,
    "articleText": `Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Он написал больше 30 хитов. Достичь успеха помогут ежедневные повторения. Как начать действовать? Для начала просто соберитесь.`,
    "categories": [`Кино`, `За жизнь`, `IT`],
    "comments": [
      {
        "user": `sidorov@example.com`,
        "text": `Хочу такую же футболку :-)\r Плюсую, но слишком много буквы!\r Совсем немного...\r`
      },
      {
        "user": `petrov@example.com`,
        "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.\r`
      }
    ]
  },
  {
    "user": `sidorov@example.com`,
    "title": `Как собрать камни бесконечности`,
    "announce": `Собрать камни бесконечности легко, если вы прирожденный герой.`,
    "articleText": `Это один из лучших рок-музыкантов. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Ёлки — это не просто красивое дерево. Это прочная древесина. Достичь успеха помогут ежедневные повторения.`,
    "categories": [`Программирование`, `IT`, `Деревья`, `Железо`, `За жизнь`, `Музыка`],
    "comments": [
      {
        "user": `petrov@example.com`,
        "text": `Планируете записать видосик на эту тему?`
      }
    ]
  },
  {
    "user": `ivanov@example.com`,
    "title": `Как начать программировать`,
    "announce": `Достичь успеха помогут ежедневные повторения.`,
    "articleText": `Он написал больше 30 хитов. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Собрать камни бесконечности легко, если вы прирожденный герой. Программировать не настолько сложно, как об этом говорят.`,
    "categories": [`Железо`, `Без рамки`, `IT`, `Деревья`, `Программирование`, `Кино`, `Музыка`],
    "comments": [
      {
        "user": `sidorov@example.com`,
        "text": `Мне кажется или я уже читал это где-то?\r Совсем немного...\r Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.\r`
      },
      {
        "user": `petrov@example.com`,
        "text": `Согласен с автором!\r Плюсую, но слишком много буквы!\r`
      },
      {
        "user": `petrov@example.com`,
        "text": `Хочу такую же футболку :-)\r`
      }
    ]
  }
];
