'use strict';

const mockData = [
  {
    "id": `jDuz1E`,
    "title": `Как собрать камни бесконечности`,
    "announce": `Из под его пера вышло 8 платиновых альбомов.`,
    "text": `Он написал больше 30 хитов. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Достичь успеха помогут ежедневные повторения.`,
    "createdDate": `2022-02-09 17:10:02`,
    "category": [`Кино`, `Разное`],
    "comments": [
      {
        "id": `0tuMqv`,
        "text": `Хочу такую же футболку :-)\r Мне кажется или я уже читал это где-то?\r Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.\r`
      },
      {
        "id": `DvfcAd`,
        "text": `Плюсую, но слишком много буквы!\r`
      },
      {
        "id": `PzvQop`,
        "text": `Хочу такую же футболку :-)\r Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.\r Мне кажется или я уже читал это где-то?\r`}
    ]
  },
  {
    "id": `CTjWVF`,
    "title": `Лучшие рок-музыканты 20-века`,
    "announce": `Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.`,
    "text": `Ёлки — это не просто красивое дерево. Это прочная древесина. Собрать камни бесконечности легко, если вы прирожденный герой. Как начать действовать? Для начала просто соберитесь. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.`,
    "createdDate": `2022-03-22 17:01:53`,
    "category": [`Программирование`, `Без рамки`, `Кино`, `IT`, `Деревья`, `Разное`],
    "comments": [
      {
        "id": `dpCSdt`,
        "text": `Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.\r`
      },
      {
        "id": `3TZjzX`,
        "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.\r`
      }
    ]
  },
  {"id": `Ta3ess`,
    "title": `Как начать программировать`,
    "announce": `Золотое сечение — соотношение двух величин, гармоническая пропорция.`,
    "text": `Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Он написал больше 30 хитов. Достичь успеха помогут ежедневные повторения. Как начать действовать? Для начала просто соберитесь.`,
    "createdDate": `2022-03-18 05:54:10`,
    "category": [`Кино`, `За жизнь`, `IT`],
    "comments": [
      {"id": `fKsWot`,
        "text": `Хочу такую же футболку :-)\r Плюсую, но слишком много буквы!\r Совсем немного...\r`
      },
      {
        "id": `LbjGXW`,
        "text": `Мне не нравится ваш стиль. Ощущение, что вы меня поучаете.\r`
      }
    ]
  },
  {
    "id": `kc-DHU`,
    "title": `Как собрать камни бесконечности`,
    "announce": `Собрать камни бесконечности легко, если вы прирожденный герой.`,
    "text": `Это один из лучших рок-музыкантов. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Ёлки — это не просто красивое дерево. Это прочная древесина. Достичь успеха помогут ежедневные повторения.`,
    "createdDate": `2022-04-02 22:52:42`,
    "category": [`Программирование`, `IT`, `Деревья`, `Железо`, `За жизнь`, `Музыка`],
    "comments": [
      {
        "id": `FDotme`,
        "text": `Планируете записать видосик на эту тему?`
      }
    ]
  },
  {
    "id": `xjQC9s`,
    "title": `Как начать программировать`,
    "announce": `Достичь успеха помогут ежедневные повторения.`,
    "text": `Он написал больше 30 хитов. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Собрать камни бесконечности легко, если вы прирожденный герой. Программировать не настолько сложно, как об этом говорят.`,
    "createdDate": `2022-03-09 18:43:03`,
    "category": [`Железо`, `Без рамки`, `IT`, `Деревья`, `Программирование`, `Кино`, `Музыка`],
    "comments": [
      {
        "id": `hrvSmo`,
        "text": `Мне кажется или я уже читал это где-то?\r Совсем немного...\r Давно не пользуюсь стационарными компьютерами. Ноутбуки победили.\r`
      },
      {
        "id": `qlBsVj`,
        "text": `Согласен с автором!\r Плюсую, но слишком много буквы!\r`
      },
      {
        "id": `ZWAtZh`,
        "text": `Хочу такую же футболку :-)\r`
      }
    ]
  }
];

module.exports = {mockData};
